veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEray_regdef.h
/** \brief Message Buffer Status Changed 1 */
typedef struct _Ifx_ERAY_MBSC1_Bits
{
    Ifx_UReg_32Bit MBC0:1;            /**< \brief [0:0] Message Buffer Status Changed 0 (n = 0-31) - MBC0 (rh) */
    Ifx_UReg_32Bit MBC1:1;            /**< \brief [1:1] Message Buffer Status Changed 1 (n = 0-31) - MBC1 (rh) */
    Ifx_UReg_32Bit MBC2:1;            /**< \brief [2:2] Message Buffer Status Changed 2 (n = 0-31) - MBC2 (rh) */
    Ifx_UReg_32Bit MBC3:1;            /**< \brief [3:3] Message Buffer Status Changed 3 (n = 0-31) - MBC3 (rh) */
    Ifx_UReg_32Bit MBC4:1;            /**< \brief [4:4] Message Buffer Status Changed 4 (n = 0-31) - MBC4 (rh) */
    Ifx_UReg_32Bit MBC5:1;            /**< \brief [5:5] Message Buffer Status Changed 5 (n = 0-31) - MBC5 (rh) */
    Ifx_UReg_32Bit MBC6:1;            /**< \brief [6:6] Message Buffer Status Changed 6 (n = 0-31) - MBC6 (rh) */
    Ifx_UReg_32Bit MBC7:1;            /**< \brief [7:7] Message Buffer Status Changed 7 (n = 0-31) - MBC7 (rh) */
    Ifx_UReg_32Bit MBC8:1;            /**< \brief [8:8] Message Buffer Status Changed 8 (n = 0-31) - MBC8 (rh) */
    Ifx_UReg_32Bit MBC9:1;            /**< \brief [9:9] Message Buffer Status Changed 9 (n = 0-31) - MBC9 (rh) */
    Ifx_UReg_32Bit MBC10:1;           /**< \brief [10:10] Message Buffer Status Changed 10 (n = 0-31) - MBC10 (rh) */
    Ifx_UReg_32Bit MBC11:1;           /**< \brief [11:11] Message Buffer Status Changed 11 (n = 0-31) - MBC11 (rh) */
    Ifx_UReg_32Bit MBC12:1;           /**< \brief [12:12] Message Buffer Status Changed 12 (n = 0-31) - MBC12 (rh) */
    Ifx_UReg_32Bit MBC13:1;           /**< \brief [13:13] Message Buffer Status Changed 13 (n = 0-31) - MBC13 (rh) */
    Ifx_UReg_32Bit MBC14:1;           /**< \brief [14:14] Message Buffer Status Changed 14 (n = 0-31) - MBC14 (rh) */
    Ifx_UReg_32Bit MBC15:1;           /**< \brief [15:15] Message Buffer Status Changed 15 (n = 0-31) - MBC15 (rh) */
    Ifx_UReg_32Bit MBC16:1;           /**< \brief [16:16] Message Buffer Status Changed 16 (n = 0-31) - MBC16 (rh) */
    Ifx_UReg_32Bit MBC17:1;           /**< \brief [17:17] Message Buffer Status Changed 17 (n = 0-31) - MBC17 (rh) */
    Ifx_UReg_32Bit MBC18:1;           /**< \brief [18:18] Message Buffer Status Changed 18 (n = 0-31) - MBC18 (rh) */
    Ifx_UReg_32Bit MBC19:1;           /**< \brief [19:19] Message Buffer Status Changed 19 (n = 0-31) - MBC19 (rh) */
    Ifx_UReg_32Bit MBC20:1;           /**< \brief [20:20] Message Buffer Status Changed 20 (n = 0-31) - MBC20 (rh) */
    Ifx_UReg_32Bit MBC21:1;           /**< \brief [21:21] Message Buffer Status Changed 21 (n = 0-31) - MBC21 (rh) */
    Ifx_UReg_32Bit MBC22:1;           /**< \brief [22:22] Message Buffer Status Changed 22 (n = 0-31) - MBC22 (rh) */
    Ifx_UReg_32Bit MBC23:1;           /**< \brief [23:23] Message Buffer Status Changed 23 (n = 0-31) - MBC23 (rh) */
    Ifx_UReg_32Bit MBC24:1;           /**< \brief [24:24] Message Buffer Status Changed 24 (n = 0-31) - MBC24 (rh) */
    Ifx_UReg_32Bit MBC25:1;           /**< \brief [25:25] Message Buffer Status Changed 25 (n = 0-31) - MBC25 (rh) */
    Ifx_UReg_32Bit MBC26:1;           /**< \brief [26:26] Message Buffer Status Changed 26 (n = 0-31) - MBC26 (rh) */
    Ifx_UReg_32Bit MBC27:1;           /**< \brief [27:27] Message Buffer Status Changed 27 (n = 0-31) - MBC27 (rh) */
    Ifx_UReg_32Bit MBC28:1;           /**< \brief [28:28] Message Buffer Status Changed 28 (n = 0-31) - MBC28 (rh) */
    Ifx_UReg_32Bit MBC29:1;           /**< \brief [29:29] Message Buffer Status Changed 29 (n = 0-31) - MBC29 (rh) */
    Ifx_UReg_32Bit MBC30:1;           /**< \brief [30:30] Message Buffer Status Changed 30 (n = 0-31) - MBC30 (rh) */
    Ifx_UReg_32Bit MBC31:1;           /**< \brief [31:31] Message Buffer Status Changed 31 (n = 0-31) - MBC31 (rh) */
} Ifx_ERAY_MBSC1_Bits;

/** \brief Message Buffer Status Changed 2 */
typedef struct _Ifx_ERAY_MBSC2_Bits
{
    Ifx_UReg_32Bit MBC32:1;           /**< \brief [0:0] Message Buffer Status Changed 32 (n = 32-63) - MBC32 (rh) */
    Ifx_UReg_32Bit MBC33:1;           /**< \brief [1:1] Message Buffer Status Changed 33 (n = 32-63) - MBC33 (rh) */
    Ifx_UReg_32Bit MBC34:1;           /**< \brief [2:2] Message Buffer Status Changed 34 (n = 32-63) - MBC34 (rh) */
    Ifx_UReg_32Bit MBC35:1;           /**< \brief [3:3] Message Buffer Status Changed 35 (n = 32-63) - MBC35 (rh) */
    Ifx_UReg_32Bit MBC36:1;           /**< \brief [4:4] Message Buffer Status Changed 36 (n = 32-63) - MBC36 (rh) */
    Ifx_UReg_32Bit MBC37:1;           /**< \brief [5:5] Message Buffer Status Changed 37 (n = 32-63) - MBC37 (rh) */
    Ifx_UReg_32Bit MBC38:1;           /**< \brief [6:6] Message Buffer Status Changed 38 (n = 32-63) - MBC38 (rh) */
    Ifx_UReg_32Bit MBC39:1;           /**< \brief [7:7] Message Buffer Status Changed 39 (n = 32-63) - MBC39 (rh) */
    Ifx_UReg_32Bit MBC40:1;           /**< \brief [8:8] Message Buffer Status Changed 40 (n = 32-63) - MBC40 (rh) */
    Ifx_UReg_32Bit MBC41:1;           /**< \brief [9:9] Message Buffer Status Changed 41 (n = 32-63) - MBC41 (rh) */
    Ifx_UReg_32Bit MBC42:1;           /**< \brief [10:10] Message Buffer Status Changed 42 (n = 32-63) - MBC42 (rh) */
    Ifx_UReg_32Bit MBC43:1;           /**< \brief [11:11] Message Buffer Status Changed 43 (n = 32-63) - MBC43 (rh) */
    Ifx_UReg_32Bit MBC44:1;           /**< \brief [12:12] Message Buffer Status Changed 44 (n = 32-63) - MBC44 (rh) */
    Ifx_UReg_32Bit MBC45:1;           /**< \brief [13:13] Message Buffer Status Changed 45 (n = 32-63) - MBC45 (rh) */
    Ifx_UReg_32Bit MBC46:1;           /**< \brief [14:14] Message Buffer Status Changed 46 (n = 32-63) - MBC46 (rh) */
    Ifx_UReg_32Bit MBC47:1;           /**< \brief [15:15] Message Buffer Status Changed 47 (n = 32-63) - MBC47 (rh) */
    Ifx_UReg_32Bit MBC48:1;           /**< \brief [16:16] Message Buffer Status Changed 48 (n = 32-63) - MBC48 (rh) */
    Ifx_UReg_32Bit MBC49:1;           /**< \brief [17:17] Message Buffer Status Changed 49 (n = 32-63) - MBC49 (rh) */
    Ifx_UReg_32Bit MBC50:1;           /**< \brief [18:18] Message Buffer Status Changed 50 (n = 32-63) - MBC50 (rh) */
    Ifx_UReg_32Bit MBC51:1;           /**< \brief [19:19] Message Buffer Status Changed 51 (n = 32-63) - MBC51 (rh) */
    Ifx_UReg_32Bit MBC52:1;           /**< \brief [20:20] Message Buffer Status Changed 52 (n = 32-63) - MBC52 (rh) */
    Ifx_UReg_32Bit MBC53:1;           /**< \brief [21:21] Message Buffer Status Changed 53 (n = 32-63) - MBC53 (rh) */
    Ifx_UReg_32Bit MBC54:1;           /**< \brief [22:22] Message Buffer Status Changed 54 (n = 32-63) - MBC54 (rh) */
    Ifx_UReg_32Bit MBC55:1;           /**< \brief [23:23] Message Buffer Status Changed 55 (n = 32-63) - MBC55 (rh) */
    Ifx_UReg_32Bit MBC56:1;           /**< \brief [24:24] Message Buffer Status Changed 56 (n = 32-63) - MBC56 (rh) */
    Ifx_UReg_32Bit MBC57:1;           /**< \brief [25:25] Message Buffer Status Changed 57 (n = 32-63) - MBC57 (rh) */
    Ifx_UReg_32Bit MBC58:1;           /**< \brief [26:26] Message Buffer Status Changed 58 (n = 32-63) - MBC58 (rh) */
    Ifx_UReg_32Bit MBC59:1;           /**< \brief [27:27] Message Buffer Status Changed 59 (n = 32-63) - MBC59 (rh) */
    Ifx_UReg_32Bit MBC60:1;           /**< \brief [28:28] Message Buffer Status Changed 60 (n = 32-63) - MBC60 (rh) */
    Ifx_UReg_32Bit MBC61:1;           /**< \brief [29:29] Message Buffer Status Changed 61 (n = 32-63) - MBC61 (rh) */
    Ifx_UReg_32Bit MBC62:1;           /**< \brief [30:30] Message Buffer Status Changed 62 (n = 32-63) - MBC62 (rh) */
    Ifx_UReg_32Bit MBC63:1;           /**< \brief [31:31] Message Buffer Status Changed 63 (n = 32-63) - MBC63 (rh) */
} Ifx_ERAY_MBSC2_Bits;

/** \brief Message Buffer Status Changed 3 */
typedef struct _Ifx_ERAY_MBSC3_Bits
{
    Ifx_UReg_32Bit MBC64:1;           /**< \brief [0:0] Message Buffer Status Changed 64 (n = 64-95) - MBC64 (rh) */
    Ifx_UReg_32Bit MBC65:1;           /**< \brief [1:1] Message Buffer Status Changed 65 (n = 64-95) - MBC65 (rh) */
    Ifx_UReg_32Bit MBC66:1;           /**< \brief [2:2] Message Buffer Status Changed 66 (n = 64-95) - MBC66 (rh) */
    Ifx_UReg_32Bit MBC67:1;           /**< \brief [3:3] Message Buffer Status Changed 67 (n = 64-95) - MBC67 (rh) */
    Ifx_UReg_32Bit MBC68:1;           /**< \brief [4:4] Message Buffer Status Changed 68 (n = 64-95) - MBC68 (rh) */
    Ifx_UReg_32Bit MBC69:1;           /**< \brief [5:5] Message Buffer Status Changed 69 (n = 64-95) - MBC69 (rh) */
    Ifx_UReg_32Bit MBC70:1;           /**< \brief [6:6] Message Buffer Status Changed 70 (n = 64-95) - MBC70 (rh) */
    Ifx_UReg_32Bit MBC71:1;           /**< \brief [7:7] Message Buffer Status Changed 71 (n = 64-95) - MBC71 (rh) */
    Ifx_UReg_32Bit MBC72:1;           /**< \brief [8:8] Message Buffer Status Changed 72 (n = 64-95) - MBC72 (rh) */
    Ifx_UReg_32Bit MBC73:1;           /**< \brief [9:9] Message Buffer Status Changed 73 (n = 64-95) - MBC73 (rh) */
    Ifx_UReg_32Bit MBC74:1;           /**< \brief [10:10] Message Buffer Status Changed 74 (n = 64-95) - MBC74 (rh) */
    Ifx_UReg_32Bit MBC75:1;           /**< \brief [11:11] Message Buffer Status Changed 75 (n = 64-95) - MBC75 (rh) */
    Ifx_UReg_32Bit MBC76:1;           /**< \brief [12:12] Message Buffer Status Changed 76 (n = 64-95) - MBC76 (rh) */
    Ifx_UReg_32Bit MBC77:1;           /**< \brief [13:13] Message Buffer Status Changed 77 (n = 64-95) - MBC77 (rh) */
    Ifx_UReg_32Bit MBC78:1;           /**< \brief [14:14] Message Buffer Status Changed 78 (n = 64-95) - MBC78 (rh) */
    Ifx_UReg_32Bit MBC79:1;           /**< \brief [15:15] Message Buffer Status Changed 79 (n = 64-95) - MBC79 (rh) */
    Ifx_UReg_32Bit MBC80:1;           /**< \brief [16:16] Message Buffer Status Changed 80 (n = 64-95) - MBC80 (rh) */
    Ifx_UReg_32Bit MBC81:1;           /**< \brief [17:17] Message Buffer Status Changed 81 (n = 64-95) - MBC81 (rh) */
    Ifx_UReg_32Bit MBC82:1;           /**< \brief [18:18] Message Buffer Status Changed 82 (n = 64-95) - MBC82 (rh) */
    Ifx_UReg_32Bit MBC83:1;           /**< \brief [19:19] Message Buffer Status Changed 83 (n = 64-95) - MBC83 (rh) */
    Ifx_UReg_32Bit MBC84:1;           /**< \brief [20:20] Message Buffer Status Changed 84 (n = 64-95) - MBC84 (rh) */
    Ifx_UReg_32Bit MBC85:1;           /**< \brief [21:21] Message Buffer Status Changed 85 (n = 64-95) - MBC85 (rh) */
    Ifx_UReg_32Bit MBC86:1;           /**< \brief [22:22] Message Buffer Status Changed 86 (n = 64-95) - MBC86 (rh) */
    Ifx_UReg_32Bit MBC87:1;           /**< \brief [23:23] Message Buffer Status Changed 87 (n = 64-95) - MBC87 (rh) */
    Ifx_UReg_32Bit MBC88:1;           /**< \brief [24:24] Message Buffer Status Changed 88 (n = 64-95) - MBC88 (rh) */
    Ifx_UReg_32Bit MBC89:1;           /**< \brief [25:25] Message Buffer Status Changed 89 (n = 64-95) - MBC89 (rh) */
    Ifx_UReg_32Bit MBC90:1;           /**< \brief [26:26] Message Buffer Status Changed 90 (n = 64-95) - MBC90 (rh) */
    Ifx_UReg_32Bit MBC91:1;           /**< \brief [27:27] Message Buffer Status Changed 91 (n = 64-95) - MBC91 (rh) */
    Ifx_UReg_32Bit MBC92:1;           /**< \brief [28:28] Message Buffer Status Changed 92 (n = 64-95) - MBC92 (rh) */
    Ifx_UReg_32Bit MBC93:1;           /**< \brief [29:29] Message Buffer Status Changed 93 (n = 64-95) - MBC93 (rh) */
    Ifx_UReg_32Bit MBC94:1;           /**< \brief [30:30] Message Buffer Status Changed 94 (n = 64-95) - MBC94 (rh) */
    Ifx_UReg_32Bit MBC95:1;           /**< \brief [31:31] Message Buffer Status Changed 95 (n = 64-95) - MBC95 (rh) */
} Ifx_ERAY_MBSC3_Bits;

/** \brief Message Buffer Status Changed 4 */
typedef struct _Ifx_ERAY_MBSC4_Bits
{
    Ifx_UReg_32Bit MBC96:1;           /**< \brief [0:0] Message Buffer Status Changed 96 (n = 96-127) - MBC96 (rh) */
    Ifx_UReg_32Bit MBC97:1;           /**< \brief [1:1] Message Buffer Status Changed 97 (n = 96-127) - MBC97 (rh) */
    Ifx_UReg_32Bit MBC98:1;           /**< \brief [2:2] Message Buffer Status Changed 98 (n = 96-127) - MBC98 (rh) */
    Ifx_UReg_32Bit MBC99:1;           /**< \brief [3:3] Message Buffer Status Changed 99 (n = 96-127) - MBC99 (rh) */
    Ifx_UReg_32Bit MBC100:1;          /**< \brief [4:4] Message Buffer Status Changed 100 (n = 96-127) - MBC100 (rh) */
    Ifx_UReg_32Bit MBC101:1;          /**< \brief [5:5] Message Buffer Status Changed 101 (n = 96-127) - MBC101 (rh) */
    Ifx_UReg_32Bit MBC102:1;          /**< \brief [6:6] Message Buffer Status Changed 102 (n = 96-127) - MBC102 (rh) */
    Ifx_UReg_32Bit MBC103:1;          /**< \brief [7:7] Message Buffer Status Changed 103 (n = 96-127) - MBC103 (rh) */
    Ifx_UReg_32Bit MBC104:1;          /**< \brief [8:8] Message Buffer Status Changed 104 (n = 96-127) - MBC104 (rh) */
    Ifx_UReg_32Bit MBC105:1;          /**< \brief [9:9] Message Buffer Status Changed 105 (n = 96-127) - MBC105 (rh) */
    Ifx_UReg_32Bit MBC106:1;          /**< \brief [10:10] Message Buffer Status Changed 106 (n = 96-127) - MBC106 (rh) */
    Ifx_UReg_32Bit MBC107:1;          /**< \brief [11:11] Message Buffer Status Changed 107 (n = 96-127) - MBC107 (rh) */
    Ifx_UReg_32Bit MBC108:1;          /**< \brief [12:12] Message Buffer Status Changed 108 (n = 96-127) - MBC108 (rh) */
    Ifx_UReg_32Bit MBC109:1;          /**< \brief [13:13] Message Buffer Status Changed 109 (n = 96-127) - MBC109 (rh) */
    Ifx_UReg_32Bit MBC110:1;          /**< \brief [14:14] Message Buffer Status Changed 110 (n = 96-127) - MBC110 (rh) */
    Ifx_UReg_32Bit MBC111:1;          /**< \brief [15:15] Message Buffer Status Changed 111 (n = 96-127) - MBC111 (rh) */
    Ifx_UReg_32Bit MBC112:1;          /**< \brief [16:16] Message Buffer Status Changed 112 (n = 96-127) - MBC112 (rh) */
    Ifx_UReg_32Bit MBC113:1;          /**< \brief [17:17] Message Buffer Status Changed 113 (n = 96-127) - MBC113 (rh) */
    Ifx_UReg_32Bit MBC114:1;          /**< \brief [18:18] Message Buffer Status Changed 114 (n = 96-127) - MBC114 (rh) */
    Ifx_UReg_32Bit MBC115:1;          /**< \brief [19:19] Message Buffer Status Changed 115 (n = 96-127) - MBC115 (rh) */
    Ifx_UReg_32Bit MBC116:1;          /**< \brief [20:20] Message Buffer Status Changed 116 (n = 96-127) - MBC116 (rh) */
    Ifx_UReg_32Bit MBC117:1;          /**< \brief [21:21] Message Buffer Status Changed 117 (n = 96-127) - MBC117 (rh) */
    Ifx_UReg_32Bit MBC118:1;          /**< \brief [22:22] Message Buffer Status Changed 118 (n = 96-127) - MBC118 (rh) */
    Ifx_UReg_32Bit MBC119:1;          /**< \brief [23:23] Message Buffer Status Changed 119 (n = 96-127) - MBC119 (rh) */
    Ifx_UReg_32Bit MBC120:1;          /**< \brief [24:24] Message Buffer Status Changed 120 (n = 96-127) - MBC120 (rh) */
    Ifx_UReg_32Bit MBC121:1;          /**< \brief [25:25] Message Buffer Status Changed 121 (n = 96-127) - MBC121 (rh) */
    Ifx_UReg_32Bit MBC122:1;          /**< \brief [26:26] Message Buffer Status Changed 122 (n = 96-127) - MBC122 (rh) */
    Ifx_UReg_32Bit MBC123:1;          /**< \brief [27:27] Message Buffer Status Changed 123 (n = 96-127) - MBC123 (rh) */
    Ifx_UReg_32Bit MBC124:1;          /**< \brief [28:28] Message Buffer Status Changed 124 (n = 96-127) - MBC124 (rh) */
    Ifx_UReg_32Bit MBC125:1;          /**< \brief [29:29] Message Buffer Status Changed 125 (n = 96-127) - MBC125 (rh) */
    Ifx_UReg_32Bit MBC126:1;          /**< \brief [30:30] Message Buffer Status Changed 126 (n = 96-127) - MBC126 (rh) */
    Ifx_UReg_32Bit MBC127:1;          /**< \brief [31:31] Message Buffer Status Changed 127 (n = 96-127) - MBC127 (rh) */
} Ifx_ERAY_MBSC4_Bits;

